In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import os
plt.style.use('seaborn-colorblind')
%matplotlib inline
from data_exploration import explore

### Read the dataset

In [4]:
use_cols = [
    'Pclass', 'Sex', 'Age', 'Fare', 'SibSp',
    'Survived'
]

data = pd.read_csv('./data/titanic.csv', usecols=use_cols)

In [6]:
data.head(3)

   Survived  Pclass     Sex   Age  SibSp     Fare
0         0       3    male  22.0      1   7.2500
1         1       1  female  38.0      1  71.2833
2         1       3  female  26.0      0   7.9250

### Get dtypes for each columns

In [7]:
str_var_list, num_var_list, all_var_list = explore.get_dtypes(data=data)

In [8]:
print(str_var_list) # string type
print(num_var_list) # numeric type
print(all_var_list) # all

['Sex']
['Survived', 'Pclass', 'Age', 'SibSp', 'Fare']
['Sex', 'Survived', 'Pclass', 'Age', 'SibSp', 'Fare']

### General data description

In [10]:
explore.describe(data=data,output_path=r'./output/')

result saved at: ./output/describe.csv

          Survived      Pclass   Sex         Age       SibSp        Fare
count   891.000000  891.000000   891  714.000000  891.000000  891.000000
unique         NaN         NaN     2         NaN         NaN         NaN
top            NaN         NaN  male         NaN         NaN         NaN
freq           NaN         NaN   577         NaN         NaN         NaN
mean      0.383838    2.308642   NaN   29.699118    0.523008   32.204208
std       0.486592    0.836071   NaN   14.526497    1.102743   49.693429
min       0.000000    1.000000   NaN    0.420000    0.000000    0.000000
25%       0.000000    2.000000   NaN   20.125000    0.000000    7.910400
50%       0.000000    3.000000   NaN   28.000000    0.000000   14.454200
75%       1.000000    3.000000   NaN   38.000000    1.000000   31.000000
max       1.000000    3.000000   NaN   80.000000    8.000000  512.329200